In [1]:
import pandas as pd

# Series

In [4]:
series_test = pd.Series([100,200,300])
series_test

0    100
1    200
2    300
dtype: int64

In [7]:
series_test2 = pd.Series({1999: 48,
                          2000: 65,
                          2001: 89})
series_test2

1999    48
2000    65
2001    89
dtype: int64

# Data Frame

In [9]:
frame_test = pd.DataFrame({1999:[43,54,76],
                          2000:[76,43,23],
                          2001:[21,65,45]})
frame_test

   1999  2000  2001
0    43    76    21
1    54    43    65
2    76    23    45

In [13]:
#frame_test[columnas][filas]
frame_test[2000][1]

43

In [14]:
frame_test2 = pd.DataFrame([[43,54,76],
                           [76,43,23],
                           [21,65,45]])
frame_test2

    0   1   2
0  43  54  76
1  76  43  23
2  21  65  45

In [16]:
frame_test2 = pd.DataFrame([[43,54,76],
                           [76,43,23],
                           [21,65,45]],columns=[1999,2000,2001])
frame_test2

   1999  2000  2001
0    43    54    76
1    76    43    23
2    21    65    45

In [20]:
frame_test2[[1999,2001]]

   1999  2001
0    43    76
1    76    23
2    21    45